tutorials/AGARDWing/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

AeroFoamSchemes
{
//..............................Time integration
    timeScheme           RK2;
    CourantMax           0.0;
    CourantSteps         25;
//..............................Space integration
    flowType             Euler;
    MonotoneFlux         Roe;
    HighResolutionFlux   LW;
    fluxLimiter          VL;
    entropyFix           HH2;
//..............................Boundary conditions 
    extrapolateBC        1; 
//..............................Residual evaluation
    residualNorm         L1;  
    minResidual          -1;
//..............................Extended cells connectivity
    loadConnectivity     1;
    adaptiveConnectivity 0;
    testMesh             0;
//..............................Check for errors
    testInput            1;
}

CAE3DToolbox
{ 
// *** AGARD 445.6 *** 
//............................Aerodynamic model
    Sref_a           0.3513; 
    Lref_a           0.463;
    Xref_a.x()       0.4938;
    Xref_a.y()       0.3547;
    Xref_a.z()       0.0;    
//............................Structural model
    restart          0;
    forcingStartTime 0.025;
    printInterval    4e-6;
    solutionType     0; 
    Nmodes           4;
    NactiveMode      1;
    kMax             10.0;
    epsU             0.017455;
    qMax             0.0;
//............................Test interface    
    testInterface    0;  
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
}

laplacianSchemes
{
    default         none;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
